tap "codacy/codacy-cli-v2"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "supabase/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Angular
brew "angular-cli"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool to interact with exercism.io
brew "exercism"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Next-gen compiler infrastructure
brew "llvm@12", link: true
# Powerful, lightweight programming language
brew "lua"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Fast, highly customisable system info script
brew "neofetch"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Steel Bank Common Lisp system
brew "sbcl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# Terraform
brew "hashicorp/tap/terraform"
# Supabase CLI
brew "supabase/tap/supabase"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Android SDK component
cask "android-platform-tools"
cask "font-iosevka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# Command-line client for connecting to Snowflake
cask "snowflake-snowsql"
# System monitor for the menu bar
cask "stats"

cargo "fd-find"
cargo "mdbook"
cargo "ripgrep"
cargo "rustlings"
cargo "workshop-runner"
